# -*- coding: utf-8 -*- 
# @Time : 2019/11/20 2:06
# @Author : hangzhouwh 
# @Email: hangzhouwh@gmail.com
# @File : test.py 
# @Software: PyCharm
import re

str1 = "[00:04.050]\n[00:12.570]难以忘记初次见你\n[00:16.860]一双迷人的眼睛\n[00:21.460]在我脑海里\n[00:23.960]你的身影 挥散不去\n[" \
	   "00:30.160]握你的双手感觉你的温柔\n[00:34.940]真的有点透不过气\n[00:39.680]你的天真 我想珍惜\n[00:43.880]看到你受委屈 我会伤心\n[00:48.180]喔\n[" \
	   "00:50.340]只怕我自己会爱上你\n[00:55.070]不敢让自己靠的太近\n[00:59.550]怕我没什么能够给你\n[01:04.030]爱你也需要很大的勇气\n[01:08.190]只怕我自己会爱上你\n[" \
	   "01:12.910]也许有天会情不自禁\n[01:17.380]想念只让自己苦了自己\n[01:21.840]爱上你是我情非得已\n[01:28.810]难以忘记初次见你\n[01:33.170]一双迷人的眼睛\n[" \
	   "01:37.700]在我脑海里 你的身影 挥散不去\n[01:46.360]握你的双手感觉你的温柔\n[01:51.120]真的有点透不过气\n[01:55.910]你的天真 我想珍惜\n[02:00.150]看到你受委屈 " \
	   "我会伤心\n[02:04.490]喔\n[02:06.540]只怕我自己会爱上你\n[02:11.240]不敢让自己靠的太近\n[02:15.750]怕我没什么能够给你\n[02:20.200]爱你也需要很大的勇气\n[" \
	   "02:24.570]只怕我自己会爱上你\n[02:29.230]也许有天会情不自禁\n[02:33.680]想念只让自己苦了自己\n[02:38.140]爱上你是我情非得已\n[03:04.060]什么原因 耶\n[" \
	   "03:07.730]我竟然又会遇见你\n[03:13.020]我真的真的不愿意\n[03:16.630]就这样陷入爱的陷阱\n[03:20.700]喔\n[03:22.910]只怕我自己会爱上你\n[" \
	   "03:27.570]不敢让自己靠的太近\n[03:32.040]怕我没什么能够给你\n[03:36.560]爱你也需要很大的勇气\n[03:40.740]只怕我自己会爱上你\n[03:45.460]也许有天会情不自禁\n[" \
	   "03:49.990]想念只让自己苦了自己\n[03:54.510]爱上你是我情非得已\n[03:58.970]爱上你是我情非得已\n[04:03.000]\n "

str2 = "[00:00.000] 作曲 : 袁咏琳/URU\n[00:01.000] 作词 : 冼佩瑾\n[00:03.82]编曲：URU\n[00:05.82]\n[00:07.96]一而再再而三的退进  终究没有结局\n[" \
	   "00:15.57]为你我舍自己  为我你也尽力\n[00:22.83]\n[00:22.97]总是 one step forward two steps back\n[00:27.41]以为已学会  却还得长大\n[" \
	   "00:30.81]爱情的期限能拖多远\n[00:34.88]如果得放下  我很挣扎\n[00:38.41]\n[00:38.54]只好倔强 ‘cause I want you 宁愿和你一起迷路\n[" \
	   "00:46.15]就算累也很清楚  不要没你所在的地图\n[00:53.72]能不能就赖着别说了  能不能就安静的走着\n[01:01.12]或许有一天我们懂得  懂得怎么爱才快乐  我要快乐\n[" \
	   "01:11.22]\n[01:17.79]沉默的时候很煎熬  你爱自由我要依靠\n[01:25.17]到最后我们多傻  说穿败给骄傲\n[01:31.74]\n[01:32.46]总是 one step forward " \
	   "two steps back\n[01:36.87]以为已学会  却还得长大\n[01:40.33]爱情的期限能拖多远\n[01:44.50]如果得放下  我很挣扎\n[01:48.07]\n[01:48.24]只好倔强 " \
	   "‘cause I want you 宁愿和你一起迷路\n[01:55.76]就算累也很清楚  不要没你所在的地图\n[02:03.20]能不能就赖着别说了  能不能就安静的走着\n[02:10.81]或许有一天我们懂得  " \
	   "懂得怎么爱才快乐  我要快乐\n[02:20.56]\n[02:42.68]很倔强 ‘cause I want you 只和你一起迷路\n[02:50.01]就算累不想结束  不要没你所在的地图\n[" \
	   "02:57.50]\n[02:57.74]只好倔强 ‘cause I want you 宁愿和你一起迷路\n[03:05.44]就算累也很清楚  不要没你所在的地图\n[03:12.94]能不能就赖着别说了  " \
	   "能不能就安静的走着\n[03:20.56]或许有一天我们懂得  懂得怎么爱才快乐\n[03:27.75]我要快乐  我要快乐  我会快乐\n "

str1_new = re.sub('\[\d{2}:\d{2}.\d{2,3}\]', '', str1)
str2_new = re.sub('\[\d{2}:\d{2}.\d{2,3}\]', '', str2)

print("str1:  ")
print(str1_new)
